app/views/employees/_form.html.erb


		<td> <%= collection_select(:employee, :department_id, Department.all, :id, :name, {:prompt => true}, :class => 'department') %> </td>
---
SELECT "departments".* FROM "departments"