app/views/employees/index.html.erb

		<% @employees.each do |employee|%>
		<% department=Department.find(employee.department_id) %>
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", 1]]