app/views/employees/index.html.erb

		<datalist id="namelist">
			<% Employee.all.each do |emp| %> <option value="<%= emp.name %>"> <% end %>
---
SELECT "employees".* FROM "employees"