app/views/departments/show.html.erb

</table>
<% if @department.employees.length>0 %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."department_id" = ?  [["department_id", 7]]