app/controllers/departments_controller.rb

   def index
    @departments=Department.all
---
SELECT "departments".* FROM "departments"

  def create
    # render text: params[:department].inspect
    @department=Department.new(permission_access)
    if @department.save
---
INSERT INTO "departments" ("created_at", "location", "name", "task", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 26 Dec 2013 11:31:28 UTC +00:00], ["location", "aaaa"], ["name", "aa"], ["task", "aaa"], ["updated_at", Thu, 26 Dec 2013 11:31:28 UTC +00:00]]

  def show
    @department=Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @department=Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @department=Department.find(params[:id])
    if @department.update(permission_access)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "departments" SET "name" = ?, "task" = ?, "location" = ?, "updated_at" = ? WHERE "departments"."id" = 1  [["name", "aaaaa"], ["task", "aaa1"], ["location", "a"], ["updated_at", Thu, 26 Dec 2013 12:14:50 UTC +00:00]]

  def destroy
    @department=Department.find(params[:id])
    @department.destroy
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 2]]