app/controllers/employees_controller.rb

  def index
<<<<<<< HEAD
<<<<<<< HEAD
    @employees=Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    # render text: params[:employee].inspect
    @employee=Employee.new(permission_access)
    if @employee.save
---
INSERT INTO "employees" ("created_at", "department_id", "name", "post", "salery", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 27 Dec 2013 07:50:10 UTC +00:00], ["department_id", 1], ["name", "cvv"], ["post", "sd"], ["salery", 23234], ["updated_at", Fri, 27 Dec 2013 07:50:10 UTC +00:00]]

  def show
    @employee=Employee.find(params[:id])
    @department=Department.find(@employee.department_id)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", 4]]

  def edit
    @employee=Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @employee=Employee.find(params[:id])
    if @employee.update(permission_access)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "employees" SET "name" = ?, "post" = ?, "department_id" = ?, "updated_at" = ? WHERE "employees"."id" = 8  [["name", "Syam"], ["post", "SE"], ["department_id", 7], ["updated_at", Mon, 30 Dec 2013 04:43:20 UTC +00:00]]

  def destroy
    @employee=Employee.find(params[:id])
    @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]